{
  "contents": [
    {
      "id": 1,
      "img": "c.svg",
      "name": "C",
      "year": "1972",
      "inventor": "Dennis MacAlistair Ritchie",
      "description": "General-purpose programming language developed primarily by Dennis MacAlistair Ritchie at AT&T Bell Labs.",
      "features": "Languages frequently used in the development of embedded software\nOften used to learn the basics of programming at university\nExploded into prominence when UNIX, originally written in assembly, was rewritten in C",
      "used": "MacOS\nUNIX\nLinux",
      "pros": "Fast execution speed due to translation into native machine language",
      "cons": "High degree of difficulty e.g. pointer management"
    },
    {
      "id": 2,
      "img": "python.svg",
      "name": "Python",
      "year": "1991",
      "inventor": "Guido van Rossum",
      "description": "The idea is to make it as easy as possible to write readable, yet efficient code: Python body provides only the minimum functionality that users always need, and they download and use library as required.",
      "features": "41.3% of engineers developing data analysis systems use Python\n70.0% use it for AI systems\nProven track record in web and desktop applications",
      "used": "YouTube\nInstagram\nDrop Box",
      "pros": "Grammar is simple and easy to read\nExtensive practical libraries",
      "cons": "As an interpreted and dynamically typed language, it is slower than other languages\nTherefore, it is difficult to use in critical systems such as mission-critical systems"
    },
    {
      "id": 3,
      "img": "php.svg",
      "name": "PHP",
      "year": "1995",
      "inventor": "The PHP Group",
      "description": "An open source general-purpose programming language developed on a community basis by \"The PHP Group\" in 1995.",
      "features": "Server-side languages\nPHP originated as a tool for generating dynamic web pages",
      "used": "WordPress\nconcreat5",
      "pros": "Easy and suitable for beginners",
      "cons": "Only expected to be used in the creation of websites"
    },
    {
      "id": 4,
      "img": "typescript.svg",
      "name": "TypeScript",
      "year": "2012",
      "inventor": "Microsoft",
      "description": "2012, developed and maintained by Microsoft as a free and open source programming language.",
      "features": "A strict superset of Javascript with optional static typing and class-based object orientation.\nCreated by Microsoft to compensate for the shortcomings of large-scale application development in JavaScript.",
      "used": "No example",
      "pros": "Type declarations can increase development efficiency and safety\nJavaScript can be generated for older browsers",
      "cons": "The conversion uses such as tsc, babel or webpack, so it needs to be set up"
    }
  ]
}
